# Data Input and Output
##

In [1]:
import numpy as np
import pandas as pd

### 
# CSV
### CSV Input
### `pd.read_csv( '檔案路徑' )`

In [19]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output
### `df.to_csv( '檔案名', index=False )`

In [3]:
df.to_csv('example',index=False)

# 
# Excel
### Excel Input
### `pd.read_excel( '檔案路徑', sheetname='Sheet1' )`

In [4]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Excel Output
### `df.to_excel( '檔案名', sheet_name='表格名')`

In [5]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

# 
# HTML
#### 要先下載以下三個套件：
conda install lxml <br>
conda install html5lib <br>
conda install BeautifulSoup4 <br>
### HTML Input
在網址後加上 `.html` 就會自動抓取 DataFrame 格式

In [7]:
df = pd.read_html('https://mops.twse.com.tw/mops/web/index.html') # 公開資訊觀測站

In [14]:
df[1]

   公司代號 公司簡稱      公告日期                                 主 旨
0  1216   統一  98/07/01  中國旺旺控股有限公司及子公司98年上半年度合併財務報表暨會計師...
1  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。
2  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。
3  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。
4  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。
5  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。
6  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。
7  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。
8  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。
9  1216   統一  98/07/01                 公告本公司取得中華電信股票之相關資訊。

# 
# SQL
### create_engine( ) :
EX. create_engine( mysql://fxq:123456@192.168.100.101/sqlalchemy ) <br>
mysql:  指定是哪種資料庫連線 <br>
第一個fxq： 使用者名稱 <br>
123456： fxq使用者對應的密碼 <br>
192.168.100.101： 資料庫的ip <br>
sqlalchemy： 資料庫需要連線庫的名字 <br>

In [24]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
from sqlalchemy import create_engine

In [16]:
engine = create_engine('sqlite:///:memory:')

In [21]:
df.to_sql('data', engine)

In [22]:
sql_df = pd.read_sql('data',con=engine)

In [23]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15